# UnableToIncludePartInMerge Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForMergePartFailures..::..UnableToIncludePartInMerge Property
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class See Also
---
Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToIncludePartInMerge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToIncludePartInMerge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToIncludePartInMerge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace